system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (0 -20 0)
	(406.4 -20 0)
	(0 -3 0)
	(406.4 -3 0)
	(0 3 0)
	(406.4 3 0)
	(0 20 0)
	(406.4 20 0)
	(430 -175 0)
	(490 -175 0)
	(430 -5 0)
	(490 -5 0)
	(430 5 0)
	(490 5 0)
	(430 175 0)
	(490 175 0)
	
    (0 -20 1)
	(406.4 -20 1)
	(0 -3 1)
	(406.4 -3 1)
	(0 3 1)
	(406.4 3 1)
	(0 20 1)
	(406.4 20 1)
	(430 -175 1)
	(490 -175 1)
	(430 -5 1)
	(490 -5 1)
	(430 5 1)
	(490 5 1)
	(430 175 1)
	(490 175 1)
	
);

blocks
(
    hex (0 1 3 2 16 17 19 18) (200 10 1) simpleGrading (1 1 1)
    hex (2 3 5 4 18 19 21 20) (200 6 1) simpleGrading (1 1 1)
    hex (4 5 7 6 20 21 23 22) (200 10 1) simpleGrading (1 1 1)
    hex (3 10 12 5 19 26 28 21) (15 6 1) simpleGrading (1 1 1)
    hex (8 9 11 10 24 25 27 26) (10 28 1) simpleGrading (1 1 1)
	hex (10 11 13 12 26 27 29 28) (10 6 1) simpleGrading (1 1 1)
	hex (12 13 15 14 28 29 31 30) (10 28 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
	CVCWall
    {
        type wall;
        faces
        (
			(0 16 18 2)
			(2 18 20 4)
			(4 20 22 6)
			(0 1 17 16)
			(3 19 17 1)
			(6 22 23 7)
			(7 23 21 5)
        );
    }
	
		lowerWall
    {
        type wall;
        faces
        (
			(14 30 31 15)
			(15 31 29 13)
			(13 29 27 11)
			(11 27 25 9)
			(8 9 25 24)
			(8 24 26 10)
			(12 28 30 14)
			(5 21 28 12)
			(3 10 26 19)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
